extends Level
## Nivel 1. Edita el mapa para cambiar el nivel (la leyenda está en level.gd).


func get_map() -> PackedStringArray:
	return PackedStringArray([
		"",
		"",
		"",
		"",
		"",
		"                                                                                                                #",
		"                                                          CCCCC                               CCC              ##",
		"                                                          BBBBB                                               ###",
		"                                                                                                             ####",
		"        CCC   *                  B*B*B              CCCC                         #   #        B*B           #####",
		"                                                    BBBB                        ##   ##                    ######",
		"                            ##                                                 ###   ###                  #######",
		"  P               E         ##           E                      ^^^ E         ####   ####   E     E      ########     F",
		"######################   ####################   #######################   ########   ########################################",
		"######################   ####################   #######################   ########   ########################################",
	])
